---
kind: other
id: Methods.T:Autodesk.Revit.DB.Events.ViewExportingEventArgs
source: html/12901f5c-e3a6-2e9a-119a-241c69dc17b8.htm
---
# ViewExportingEventArgs Methods

When the event is cancellable, may call the Cancel() method to cancel it.